---
kind: enumMember
id: F:Autodesk.Revit.DB.WallCrossSection.Tapered
enum: Autodesk.Revit.DB.WallCrossSection
source: html/c0017a61-ed27-8124-f3f7-17d73c446169.htm
---
# Autodesk.Revit.DB.WallCrossSection.Tapered

A tapered wall whose angle is controlled by the parameters
 WALL_TAPERED_EXTERIOR_INWARD_ANGLE and WALL_TAPERED_INTERIOR_INWARD_ANGLE.